/*
1. შევქმნათ ფრომისი. იმის შანსი რომ ფრომისი ან დარეზოლვდება ან დარეჯექთდება უნდა იყოს 50/50.
   ანუ ზოგიერთ გამოძახებაზე უნდა დარეჯექთდეს.

2. დავწეროთ ფუნქცია რომელიც წამოიღებს მონაცემებს https://jsonplaceholder.typicode.com/users დან 
   და დაბრუნებს ამ მონაცემებს

3. დავწეროთ ფუნქცია რომელიც ეცდება წამოიღოს მონაცემები 
https://jsonplaceholde.typicode.com (ლინკი სპეციალურად რასწორია) დან.
წარუმატებელი რექუესთის შემთხვევაში ხელახლა ცადოს წამოღება 5_ჯერ 

4. დავწეროთ ფუნქცია რომელიც ეცდება წმოიღოს მონაცემები https://dummyjson.com/users დან და https://jsonplaceholder.typicode.com/users დან.
   ფუნქციამ უნდა დაგვიბრუნოს ის ლისთი რომელის ცატვირთვაც უფრო მალე მოხდება.
*/
